app/controllers/articles_controller.rb

	def create
		@article = Article.new(article_params) # initialize with attributes

		if @article.save # saves to DB
---
INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-04-19 22:03:02.308187"], ["text", "This is the first post!"], ["title", "New post 1"], ["updated_at", "2015-04-19 22:03:02.308187"]]