app/controllers/comments_controller.rb

	def create
		@article = Article.find(params[:article_id])
		@comment = @article.comments.create(comment_params)
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("article_id", "body", "commenter", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 1], ["body", "Great first post!"], ["commenter", "Pete"], ["created_at", "2015-04-19 22:04:32.640775"], ["updated_at", "2015-04-19 22:04:32.640775"]]